livingsocial_challenge/app/controllers/parses_controller.rb

INSERT INTO "parses" ("created_at", "file", "name", "purchaser_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 11 Feb 2014 08:31:06 UTC +00:00], ["file", "example_input.tab"], ["name", "example_input.tab"], ["purchaser_name", ""], ["updated_at", Tue, 11 Feb 2014 08:31:06 UTC +00:00]]
INSERT INTO "items" ("count", "created_at", "merchant_name", "updated_at") VALUES (?, ?, ?, ?)  [["count", 22], ["created_at", Tue, 11 Feb 2014 00:48:03 UTC +00:00], ["merchant_name", "someone"], ["updated_at", Tue, 11 Feb 2014 00:48:03 UTC +00:00]]
---
  def create
    amounts = []

    #created new parse entry in table, this will store th file attributes
    @parse = Parse.new(parse_params)
    # set the name to the uploaded file name
    @parse.name =  @parse.file.file.filename
    # get the type of file extension
    fileExtension = @parse.file.file.filename.split('.')[1]
    # save it so we can retieve later
    @parse.save

    # only do all parsing if file saved/uploaded, make sure its a .tab file too
    if @parse.save && fileExtension == 'tab'
      # get the carrierwave obj , so we can retrieve the file
      uploader = @parse.file
      # retrieve the uploaded file
      uploader.retrieve_from_store!(File.basename(uploader.url))
      # process/parse the uploaded file and create new record and make a array of each row amounts
      CSV.foreach(uploader.file.path, :headers => true,col_sep:"\t") do |csv_row|
        # each csv row is now parsed, just set each column in the Item record
        Item.create(:purchaser_name => csv_row['purchaser name'], :item_description => csv_row['item description'], :price => csv_row['item price'], :count => csv_row['purchase count'], :merchant_address => csv_row['merchant address'], :merchant_name => csv_row['merchant name'])